Revit 2027 API
ThermalAsset.SpecificHeat Property
 The specific heat of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SpecificHeat { get; set; }
Public Property SpecificHeat As Double
	Get
	Set
public:
property double SpecificHeat {
	double get ();
	void set (double value);
}
member SpecificHeat : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for specificHeat must be non-negative.
Remarks
 Values are in squared-feet per Kelvin, squared-second (ft²/(K · s²)) and must be non-negative.
See Also
Reference
ThermalAsset Class
Autodesk.Revit.DB Namespace